#+TITLE: Challenge 4
#+AUTHOR: 8dcc
#+OPTIONS: toc:nil
#+STARTUP: showeverything
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css">

[[file:../index.org][Index]] | [[file:index.org][Up]]

-----

#+TOC: headlines 2

* Why does this work?
:PROPERTIES:
:CUSTOM_ID: why-does-this-work
:END:

After discovering what this functions does, I decided to look a bit more into
how it works. I discovered [[https://stackoverflow.com/questions/109023/count-the-number-of-set-bits-in-a-32-bit-integer][this]] stackoverflow link. Turns out this is called
calculating the [[https://en.wikipedia.org/wiki/Hamming_weight][Hamming weight]].

The assembly function is the simplified version of this one:

#+begin_src C
#include <stdint.h>
#include <stdio.h>

int count_bits(uint32_t x) {
    /* Put count of each 2 bits into those 2 bits */
    x = (x & 0x55555555) + ((x >> 1) & 0x55555555);

    /* Put count of each 4 bits into those 4 bits */
    x = (x & 0x33333333) + ((x >> 2) & 0x33333333);

    /* Put count of each 8 bits into those 8 bits */
    x = (x & 0x0f0f0f0f) + ((x >> 4) & 0x0f0f0f0f);

    /* If (x <= 0xFF), propagates lower byte to the upper ones. I am not sure
     * why this works for bigger values. */
    x *= 0x01010101;
    return x >> 24;
}

printf("%d\n", count_bits(0x000000AB)); /* 5 */
printf("%d\n", count_bits(0xDEADBEEF)); /* 24 */
#+end_src

#+RESULTS:
|  5 |
| 24 |

Keep in mind that:

|        Hex | Binary                             |
|------------+------------------------------------|
| =0x55555555= | =0b01010101010101010101010101010101= |
| =0x33333333= | =0b00110011001100110011001100110011= |
| =0x0f0f0f0f= | =0b00001111000011110000111100001111= |

The last multiplication and shifting step is used to skip the following lines:

#+begin_src C
x = (x & 0x00ff00ff) + ((x >>  8) & 0x00ff00ff);
x = (x & 0x0000ffff) + ((x >> 16) & 0x0000ffff);
#+end_src

I still can't fully understand how this works, though.

* C translation
:PROPERTIES:
:CUSTOM_ID: c-translation
:END:

These are two C translation of the x86 assembly code, one uses multiplication
for the last step, while the other uses shifting.

#+begin_src C
#include <stdint.h>
#include <stdio.h>

uint32_t count_bits(uint32_t num) {
    num -= (num >> 1) & 0x55555555;                       /* First 4 instructions */
    num = ((num >> 2) & 0x33333333) + (num & 0x33333333); /* Next 5 instructions */
    num += (num >> 4);                                    /* Next 3 instructions */
    num &= 0x0f0f0f0f;                                    /* Next instruction */
    num = (num * 0x01010101) >> 24;                       /* Next 2 instructions */
    return num;                                           /* Last instruction */
}

/* Without the 0x01010101 constant */
uint32_t count_bits_shifting(uint32_t num) {
    num -= (num >> 1) & 0x55555555;
    num = ((num >> 2) & 0x33333333) + (num & 0x33333333);
    num += (num >> 4);
    num &= 0x0f0f0f0f;

    num += (num << 16);
    num += (num << 8);
    num >>= 24;
    return num;
}

printf("%d\n", count_bits(0x000000AB));          /* 5 */
printf("%d\n", count_bits(0xDEADBEEF));          /* 24 */
printf("%d\n", count_bits_shifting(0x000000AB)); /* 5 */
printf("%d\n", count_bits_shifting(0xDEADBEEF)); /* 24 */
#+end_src

#+RESULTS:
|  5 |
| 24 |
|  5 |
| 24 |

* Iterative C version
:PROPERTIES:
:CUSTOM_ID: iterative-c-version
:END:

A simpler (but probably slower) way of doing it with a =for= loop:

#+begin_src C
#include <stdint.h>
#include <stdio.h>

int count_bits(uint32_t x) {
    int ret = 0;

    for (; x > 0; x >>= 1)
        if (x & 1)
            ret++;

    return ret;
}

printf("%d\n", count_bits(0x000000AB)); /* 5 */
printf("%d\n", count_bits(0xDEADBEEF)); /* 24 */
#+end_src

#+RESULTS:
|  5 |
| 24 |
